[
  {
    "id": "jacqui",
    "name": "Jacqui",
    "subtitle": "Jacqui's Awakening",
    "quote": "Eight days ago, I wondered if anyone would notice if I died. Today I'm going sailing.",
    "story": "After 35 years of perfectionism-driven survival patterns, a marathon broke something open. Through somatic work and energy clearing, Jacqui discovered her \"volcanic fire\" and learned to fall apart safely. Eight days later, she was choosing purposeless play—something her 5-year-old self had waited decades to experience.",
    "outcome": "Rest without guilt, set boundaries without apology, and feel genuine excitement about her future."
  },
  {
    "id": "donald",
    "name": "Donald",
    "subtitle": "Donald's Journey",
    "quote": "The grief I've been carrying about my mother... I didn't even know it was there.",
    "story": "The quintessential high-achiever with a successful career and loving family, yet feeling emotionally distant. Through somatic work, he discovered sharp physical pain in his chest: unprocessed grief from his mother's passing driving his emotional distancing patterns.",
    "outcome": "Express authentic needs, feel his emotions fully, and connect with family on a deeper level."
  },
  {
    "id": "ajay",
    "name": "Ajay",
    "subtitle": "Ajay's Transformation",
    "quote": "I was living entirely in my head, analyzing everything. Now I can feel emotions in my body.",
    "story": "A Google executive trapped in toxic work dynamics—buying impulsively, interrupting constantly, always rushing. His transformation moved him from pure intellectual processing to somatic awareness, learning to catch stress patterns before they escalate.",
    "outcome": "Sense his body's signals, make intentional choices, and lead with presence instead of panic."
  },
  {
    "id": "antonia",
    "name": "Antonia",
    "subtitle": "Antonia's Awakening",
    "quote": "I lost my organizing principle when my kids left. Now I'm finding myself.",
    "story": "An Enneagram 8w7 \"Maverick\" facing the empty nest with characteristic intensity. Through energy work and ancestral healing, she's releasing decades of suppressed feminine energy and discovering who she is beyond the role of mother.",
    "outcome": "Embrace her feminine wisdom, honor her own needs, and step into her authentic power."
  }
]
